{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "llava-hf/llava-1.5-7b-hf",
  "bias": "none",
  "corda_config": null,
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 16,
  "lora_bias": false,
  "lora_dropout": 0.0,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 8,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "language_model.layers.1.self_attn.v_proj",
    "language_model.layers.19.self_attn.q_proj",
    "language_model.layers.5.self_attn.q_proj",
    "30.self_attn.q_proj",
    "language_model.layers.5.self_attn.v_proj",
    "language_model.layers.4.self_attn.q_proj",
    "language_model.layers.15.self_attn.v_proj",
    "30.self_attn.v_proj",
    "gate_proj",
    "language_model.layers.13.self_attn.k_proj",
    "26.self_attn.k_proj",
    "24.self_attn.q_proj",
    "language_model.layers.18.self_attn.v_proj",
    "language_model.layers.20.self_attn.v_proj",
    "language_model.layers.21.self_attn.q_proj",
    "language_model.layers.23.self_attn.q_proj",
    "29.self_attn.q_proj",
    "28.self_attn.v_proj",
    "language_model.layers.16.self_attn.v_proj",
    "language_model.layers.9.self_attn.q_proj",
    "26.self_attn.v_proj",
    "31.self_attn.v_proj",
    "language_model.layers.17.self_attn.q_proj",
    "language_model.layers.14.self_attn.k_proj",
    "language_model.layers.0.self_attn.k_proj",
    "language_model.layers.15.self_attn.q_proj",
    "language_model.layers.19.self_attn.v_proj",
    "language_model.layers.8.self_attn.v_proj",
    "language_model.layers.18.self_attn.q_proj",
    "language_model.layers.2.self_attn.k_proj",
    "24.self_attn.k_proj",
    "25.self_attn.v_proj",
    "language_model.layers.2.self_attn.q_proj",
    "language_model.layers.4.self_attn.k_proj",
    "language_model.layers.10.self_attn.v_proj",
    "language_model.layers.3.self_attn.q_proj",
    "27.self_attn.q_proj",
    "language_model.layers.1.self_attn.q_proj",
    "language_model.layers.20.self_attn.k_proj",
    "language_model.layers.11.self_attn.v_proj",
    "27.self_attn.k_proj",
    "language_model.layers.10.self_attn.q_proj",
    "language_model.layers.20.self_attn.q_proj",
    "language_model.layers.11.self_attn.k_proj",
    "25.self_attn.k_proj",
    "language_model.layers.6.self_attn.k_proj",
    "language_model.layers.8.self_attn.q_proj",
    "down_proj",
    "language_model.layers.2.self_attn.v_proj",
    "language_model.layers.21.self_attn.k_proj",
    "language_model.layers.9.self_attn.k_proj",
    "language_model.layers.18.self_attn.k_proj",
    "language_model.layers.9.self_attn.v_proj",
    "language_model.layers.7.self_attn.v_proj",
    "27.self_attn.v_proj",
    "31.self_attn.q_proj",
    "language_model.layers.12.self_attn.v_proj",
    "language_model.layers.13.self_attn.q_proj",
    "language_model.layers.23.self_attn.k_proj",
    "language_model.layers.0.self_attn.q_proj",
    "language_model.layers.22.self_attn.q_proj",
    "29.self_attn.v_proj",
    "language_model.layers.14.self_attn.v_proj",
    "language_model.layers.19.self_attn.k_proj",
    "language_model.layers.7.self_attn.q_proj",
    "language_model.layers.12.self_attn.k_proj",
    "language_model.layers.16.self_attn.q_proj",
    "29.self_attn.k_proj",
    "language_model.layers.21.self_attn.v_proj",
    "language_model.layers.8.self_attn.k_proj",
    "language_model.layers.13.self_attn.v_proj",
    "language_model.layers.7.self_attn.k_proj",
    "language_model.layers.3.self_attn.k_proj",
    "language_model.layers.3.self_attn.v_proj",
    "up_proj",
    "28.self_attn.q_proj",
    "25.self_attn.q_proj",
    "o_proj",
    "language_model.layers.6.self_attn.q_proj",
    "language_model.layers.6.self_attn.v_proj",
    "language_model.layers.22.self_attn.k_proj",
    "language_model.layers.11.self_attn.q_proj",
    "31.self_attn.k_proj",
    "30.self_attn.k_proj",
    "language_model.layers.5.self_attn.k_proj",
    "language_model.layers.14.self_attn.q_proj",
    "language_model.layers.16.self_attn.k_proj",
    "26.self_attn.q_proj",
    "language_model.layers.17.self_attn.k_proj",
    "language_model.layers.23.self_attn.v_proj",
    "language_model.layers.12.self_attn.q_proj",
    "24.self_attn.v_proj",
    "language_model.layers.4.self_attn.v_proj",
    "language_model.layers.22.self_attn.v_proj",
    "language_model.layers.10.self_attn.k_proj",
    "28.self_attn.k_proj",
    "language_model.layers.15.self_attn.k_proj",
    "language_model.layers.1.self_attn.k_proj",
    "language_model.layers.17.self_attn.v_proj",
    "language_model.layers.0.self_attn.v_proj"
  ],
  "task_type": "CAUSAL_LM",
  "trainable_token_indices": null,
  "use_dora": false,
  "use_rslora": false
}